In [12]:
# Ôn Đình Khang
# B1812346

import pandas as pd
import numpy as np 

df = pd.read_excel("https://github.com/ltdaovn/dataset/blob/master/student.xlsx?raw=true", index_col='id')
print(df)

                   name class1  mark     sex
id
1.0      Angelina Jolie   Four  75.0  female
2.0   Cristiano Ronaldo  Three  85.0    male
NaN           John Wick  Three  55.0    male
4.0           Lady Gaga   Four  60.0  female
NaN          Emma Stone   Four  60.0  female
6.0             Alex Jo   Four  55.0     NaN
7.0        Lionel Messi   Five  78.0    male
NaN                 NaN    NaN   NaN     NaN
9.0       Thierry Henry    Six  78.0    male
10.0                NaN   Four  55.0  female
11.0   Callie Hernandez    Six   NaN  female
12.0      Jessica Rothe    Six  94.0  female
13.0                Ron    NaN  55.0     NaN
14.0               King    NaN   NaN     NaN

In [13]:
# Xóa các hàng có bất kỳ giá trị nào bị rỗng
new_df = df.dropna(how='any')
print(new_df)

                   name class1  mark     sex
id
1.0      Angelina Jolie   Four  75.0  female
2.0   Cristiano Ronaldo  Three  85.0    male
NaN           John Wick  Three  55.0    male
4.0           Lady Gaga   Four  60.0  female
NaN          Emma Stone   Four  60.0  female
7.0        Lionel Messi   Five  78.0    male
9.0       Thierry Henry    Six  78.0    male
12.0      Jessica Rothe    Six  94.0  female

In [18]:
# Xóa các hàng có tất cả giá trị đều bị rỗng
new_df = df.dropna(how='all')
print(new_df)

                   name class1  mark     sex
id
1.0      Angelina Jolie   Four  75.0  female
2.0   Cristiano Ronaldo  Three  85.0    male
NaN           John Wick  Three  55.0    male
4.0           Lady Gaga   Four  60.0  female
NaN          Emma Stone   Four  60.0  female
6.0             Alex Jo   Four  55.0     NaN
7.0        Lionel Messi   Five  78.0    male
9.0       Thierry Henry    Six  78.0    male
10.0                NaN   Four  55.0  female
11.0   Callie Hernandez    Six   NaN  female
12.0      Jessica Rothe    Six  94.0  female
13.0                Ron    NaN  55.0     NaN
14.0               King    NaN   NaN     NaN

In [19]:
# Xóa các cột có bất kỳ giá trị nào bị rỗng
new_df = df.dropna(how='any', axis='rows')
print(new_df)

                   name class1  mark     sex
id
1.0      Angelina Jolie   Four  75.0  female
2.0   Cristiano Ronaldo  Three  85.0    male
NaN           John Wick  Three  55.0    male
4.0           Lady Gaga   Four  60.0  female
NaN          Emma Stone   Four  60.0  female
7.0        Lionel Messi   Five  78.0    male
9.0       Thierry Henry    Six  78.0    male
12.0      Jessica Rothe    Six  94.0  female

In [20]:
# Xóa các cột có tất cả giá trị đều bị rỗng
new_df = df.dropna(how='all', axis='rows')
print(new_df)

                   name class1  mark     sex
id
1.0      Angelina Jolie   Four  75.0  female
2.0   Cristiano Ronaldo  Three  85.0    male
NaN           John Wick  Three  55.0    male
4.0           Lady Gaga   Four  60.0  female
NaN          Emma Stone   Four  60.0  female
6.0             Alex Jo   Four  55.0     NaN
7.0        Lionel Messi   Five  78.0    male
9.0       Thierry Henry    Six  78.0    male
10.0                NaN   Four  55.0  female
11.0   Callie Hernandez    Six   NaN  female
12.0      Jessica Rothe    Six  94.0  female
13.0                Ron    NaN  55.0     NaN
14.0               King    NaN   NaN     NaN

In [21]:
# Chỉ giữ lại các hàng có từ 2 dữ liệu hợp lệ trở lên
new_df = df.dropna(thresh=2)
print(new_df)

                   name class1  mark     sex
id
1.0      Angelina Jolie   Four  75.0  female
2.0   Cristiano Ronaldo  Three  85.0    male
NaN           John Wick  Three  55.0    male
4.0           Lady Gaga   Four  60.0  female
NaN          Emma Stone   Four  60.0  female
6.0             Alex Jo   Four  55.0     NaN
7.0        Lionel Messi   Five  78.0    male
9.0       Thierry Henry    Six  78.0    male
10.0                NaN   Four  55.0  female
11.0   Callie Hernandez    Six   NaN  female
12.0      Jessica Rothe    Six  94.0  female
13.0                Ron    NaN  55.0     NaN

In [22]:
# Chỉ giữ lại các hàng có từ 3 dữ liệu hợp lệ trở lên
new_df = df.dropna(thresh=3)
print(new_df)

                   name class1  mark     sex
id
1.0      Angelina Jolie   Four  75.0  female
2.0   Cristiano Ronaldo  Three  85.0    male
NaN           John Wick  Three  55.0    male
4.0           Lady Gaga   Four  60.0  female
NaN          Emma Stone   Four  60.0  female
6.0             Alex Jo   Four  55.0     NaN
7.0        Lionel Messi   Five  78.0    male
9.0       Thierry Henry    Six  78.0    male
10.0                NaN   Four  55.0  female
11.0   Callie Hernandez    Six   NaN  female
12.0      Jessica Rothe    Six  94.0  female

In [25]:
# Chỉ giữ lại các cột có từ 11 dữ liệu hợp lệ
new_df = df.dropna(thresh=11, axis='columns') 
print(new_df)

                   name class1  mark
id
1.0      Angelina Jolie   Four  75.0
2.0   Cristiano Ronaldo  Three  85.0
NaN           John Wick  Three  55.0
4.0           Lady Gaga   Four  60.0
NaN          Emma Stone   Four  60.0
6.0             Alex Jo   Four  55.0
7.0        Lionel Messi   Five  78.0
NaN                 NaN    NaN   NaN
9.0       Thierry Henry    Six  78.0
10.0                NaN   Four  55.0
11.0   Callie Hernandez    Six   NaN
12.0      Jessica Rothe    Six  94.0
13.0                Ron    NaN  55.0
14.0               King    NaN   NaN

In [26]:
# Chỉ giữ lại các hàng có 70% dữ liệu hợp lệ trở lên
new_df = df.dropna(how='any',axis=0,thresh=df.shape[1]*0.7)
print(new_df)

                   name class1  mark     sex
id
1.0      Angelina Jolie   Four  75.0  female
2.0   Cristiano Ronaldo  Three  85.0    male
NaN           John Wick  Three  55.0    male
4.0           Lady Gaga   Four  60.0  female
NaN          Emma Stone   Four  60.0  female
6.0             Alex Jo   Four  55.0     NaN
7.0        Lionel Messi   Five  78.0    male
9.0       Thierry Henry    Six  78.0    male
10.0                NaN   Four  55.0  female
11.0   Callie Hernandez    Six   NaN  female
12.0      Jessica Rothe    Six  94.0  female

In [27]:
#Chỉ giữ lại các cột có 80% dữ liệu hợp lệ trở lên
new_df = df.dropna(how='any',axis='columns',thresh=df.shape[1]*0.8)
print(new_df)

                   name class1  mark     sex
id
1.0      Angelina Jolie   Four  75.0  female
2.0   Cristiano Ronaldo  Three  85.0    male
NaN           John Wick  Three  55.0    male
4.0           Lady Gaga   Four  60.0  female
NaN          Emma Stone   Four  60.0  female
6.0             Alex Jo   Four  55.0     NaN
7.0        Lionel Messi   Five  78.0    male
NaN                 NaN    NaN   NaN     NaN
9.0       Thierry Henry    Six  78.0    male
10.0                NaN   Four  55.0  female
11.0   Callie Hernandez    Six   NaN  female
12.0      Jessica Rothe    Six  94.0  female
13.0                Ron    NaN  55.0     NaN
14.0               King    NaN   NaN     NaN